#include <stdio.h>
#include <stdlib.h>
int test(int);
int main() {
  int matrix[3][3], i, j;
  int *p[3], (*q)[3];
  for (int i = 0; i < 3; i++)
    for (int j = 0; j < 3; j++)
      matrix[i][j] = i * 10 + j;
  // p = matrix + 1;
  for (int i = 0; i < 3; i++) {
    for (int l = 0; l < 3; l++)
      printf(l ? " %d" : "%d", matrix[i][l]);
    printf("\n");
  }
  printf("\n");
  for (int l = 0; l < 3; l++)
    printf(l ? " %d" : "%d", matrix[i][l]);
  printf("\n");
  return 0;
  int *f(int *);
}
// int (*f(int**p))[10]
// int *f(int*);
// int (*f)(int*);
// 1.论述空想社会主义理论的“空想性”并进行评价。(答案要求不少于600字)
// 2.论述科学社会主义的核心理论观点及其对后世社会主义运动的影响。(答案求不少于600字)
// 3.论述十月革命对社会主义发展道路的影响。(答案要求不少于600字)
// 4.论述中国式现代化在社会主义发展史上的历史贡献。(答案要求不少于600)
// 1.论述空想社会主义理论的“空想性”并进行评价。(600-800字)
// 2.论述科学社会主义的核心理论观点及其对后世社会主义运动的影响。(600-800字)
// 3.论述十月革命对社会主义发展道路的影响。(600-800字)
// 4.论述中国式现代化在社会主义发展史上的历史贡献。(600-800字)