#include <stdio.h>
int main() {
  printf(
      "\e[0m显示方式\n\e[0m0：默认值\n\e[1m1：粗体//"
      "高亮\n\e[2m2：设置一半亮度\n\e[4m4：下划线\n\e[5m5：闪烁\n\e["
      "7m7：反显、翻转前景色和背景色\n\e[22m22：非粗体\n\e[24m24：无下滑线\n\e["
      "25m25：无闪烁\n\e[27m27：关闭反显\n\n\e[0m前景色（字体颜色）\n\e["
      "30m30：黑色前景色\n\e["
      "31m31：红色前景色\n\e[32m32：绿色前景色\n\e[33m33：黄色前景色\n\e["
      "34m34：蓝色前景色\n\e["
      "35m35：紫色前景色\n\e[36m36：粉色前景色\n\e[37m37：白色前景色\n\e["
      "0m"
      "\n背景色\n\e["
      "40m40：黑色背景色\e[0m\n\e[41m41：红色背景色\e[0m\n\e["
      "42m42：绿色背景色\e["
      "0m\n\e["
      "43m43：黄色背景色\e[0m\n\e["
      "44m44：蓝色背景色\e[0m\n\e[45m45：紫色背景色\e[0m\n\e["
      "46m46：粉色背景色\e[0m\n\e["
      "47m47：白色背景色\e[0m\n\e[0"
      "m");
  return 0;
}